nya-a-cat/edgefit/tools/espdl-qemu/firmware/sdkconfig.defaults
# QEMU 不提供真实 PSRAM 证据；示例模型保持在内部 RAM/Flash 边界内运行。
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE=y
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_LOG_COLORS=n
